app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Steely Dan"], ["created_at", "2019-08-16 17:36:39.154828"], ["updated_at", "2019-08-16 17:36:39.154828"]]